export const ChartDefaultSelected = {
  // 疑似监测样品为空气
  '9104ab9f-d3f3-4bd9-a0d9-898d87def4dd': ['实测NOx'],
  // 疑似监测样品混入氮气
  '1fed575c-48d7-4eef-9266-735fe4bbdb2a': ['实测NOx'],
  // 疑似监测样品混入空气
  '5520e6f2-ac4a-4f24-bafd-48746a13f4a4': ['实测NOx'],
  // 疑似监测样品混入氧混合气
  '1b9afa8d-1200-4fb1-aab0-a59936c3f22d': ['实测NOx'],
  // 疑似人为修改过量空气系数
  '3d209ce2-da92-44c4-916b-8874d05da558': ['实测SO₂'],
  // 疑似人为修改速度场系数
  'ce61d9a9-5d0d-4b66-abbd-72a89e823ee2': ['实测SO₂'],
  // 疑似人为修改颗粒物斜率截距
  '5bfd23c7-03da-4f4b-a258-a9c618774ab9': ['实测烟尘'],
  // 疑似超过预设值数据恒定
  '1a606047-6f21-4357-a459-03ef7788e09a': ['实测SO₂', '实测NOx'],
  // 疑似使用随机数产生数据
  '39680c93-e03f-42cf-a21f-115255251d4e': ['实测SO₂', '实测NOx'],
  // 疑似按预设公式处理数据
  '983cd7b9-55e1-47f3-b369-2df7bc0a6111': ['实测SO₂', '实测NOx'],
  // 疑似篡改分析仪量程
  '069ab699-428a-4f4b-8df7-915d6b4f3215': ['实测SO₂', '实测NOx'],
  'ab2bf5ec-3ade-43fc-a720-c8fd92ede402': ['实测SO₂', '实测NOx'],
  // 疑似机组停运未及时上报
  '928ec327-d30d-4803-ae83-eab3a93538c1': ['实测NOx'],
  // 疑似机组停运虚假标记
  '3568b3c6-d8db-42f1-bbff-e76406a67f7f': ['实测NOx'],
};

export const checkType = {
  1: '工况正常',
  2: '核实有异常',
  3: '待核实',
};

// 全企业波动范围默认污染物
export const PollutantListConst = [
  { PollutantName: '实测烟尘', PollutantCode: '01' },
  { PollutantName: '实测SO₂', PollutantCode: '02' },
  { PollutantName: '实测NOx', PollutantCode: '03' },
  { PollutantName: '烟气温度', PollutantCode: 's03' },
  { PollutantName: '烟气静压', PollutantCode: 's08' },
  { PollutantName: '烟气湿度', PollutantCode: 's05' },
  { PollutantName: '流速', PollutantCode: 's02' },
  { PollutantName: '氧含量', PollutantCode: 's01' },
  { PollutantName: '流量', PollutantCode: 'b02' },
];

// 根据污染物code获取name
export const getPollutantNameByCode = {
  '01': '实测烟尘',
  zs01: '折算烟尘',
  '02': '实测SO₂',
  zs02: '折算SO₂',
  '03': '实测NOx',
  zs03: '折算NOx',
  s01: '氧含量',
  s03: '烟气温度',
  s08: '烟气静压',
  s05: '烟气湿度',
  s02: '流速',
  b02: '流量',
};

// 根据污染物code获取颜色
export const getColorByName = {
  实测烟尘: '#38a2da',
  折算烟尘: '#32c5e9',
  '实测SO₂': '#e062ae',
  '折算SO₂': '#e690d1',
  实测NOx: '#8279ea',
  折算NOx: '#9D97F6',
  氧含量: '#9fe6b8',
  烟气温度: '#ffdb5c',
  烟气静压: '#ff9f7f',
  // 烟气湿度: '#c23531',
  烟气湿度: '#13c2c2',
  流速: '#c4ccd3',
  流量: '#61a0a8',
};

export const ModelNumberIdsDatas = {
  all: [],
  // 波动范围异常分析：疑似篡改分析仪量程、疑似人为修改颗粒物斜率截距
  2.2: ['069ab699-428a-4f4b-8df7-915d6b4f3215', '5bfd23c7-03da-4f4b-a258-a9c618774ab9'],
  // 样气异常识别:疑似监测样品为空气,疑似监测样品混入氮气,疑似监测样品混入空气,疑似监测样品混入氧混合气
  4.1: [
    '9104ab9f-d3f3-4bd9-a0d9-898d87def4dd',
    '1fed575c-48d7-4eef-9266-735fe4bbdb2a',
    '5520e6f2-ac4a-4f24-bafd-48746a13f4a4',
    '1b9afa8d-1200-4fb1-aab0-a59936c3f22d',
  ],
  // 参数变化识别：疑似人为修改烟道截面积、疑似人为修改过量空气系数、疑似人为修改速度场系数、疑似计算公式错误
  5.1: [
    'c934b575-a357-4a2c-b493-02849ce9cee3',
    '3d209ce2-da92-44c4-916b-8874d05da558',
    'ce61d9a9-5d0d-4b66-abbd-72a89e823ee2',
    'a59cce2a-8558-4c42-8a45-4d8402e4b29d',
  ],
  // 模拟监测数据:  疑似超过预设值数据恒定、疑似疑似使用随机数产生数据、疑似按预设公式处理数据、疑似远程控制监测数据
  5.2: [
    '1a606047-6f21-4357-a459-03ef7788e09a',
    '39680c93-e03f-42cf-a21f-115255251d4e',
    '983cd7b9-55e1-47f3-b369-2df7bc0a6111',
    'b52087fb-563c-4939-a11f-f86b10da63c1',
  ],
  // 多排放源数据一致性分析: 疑似借用其他合格监测设备数据、疑似替换分析仪监测样气
  6.1: ['c0af25fb-220b-45c6-a3de-f6c8142de8f1', 'ab2bf5ec-3ade-43fc-a720-c8fd92ede402'],
  // 同一排放源时间序列数据相似分析： 疑似借用本设备合格历史数据
  6.2: ['d5dea4cc-bd6c-44fa-a122-a1f44514b465'],
  // 多组分数据相关性分析: 疑似引用错误、虚假原始信号值
  6.3: ['f021147d-e7c6-4c1d-9634-1d814ff9880a'],
  // 虚假标记异常识别: 疑似机组停运未及时上报、疑似机组停运虚假标记、疑似超过标准标记数据无效
  7.1: [
    '928ec327-d30d-4803-ae83-eab3a93538c1',
    '3568b3c6-d8db-42f1-bbff-e76406a67f7f',
    '6675e28e-271a-4fb7-955b-79bf0b858e8e',
  ],
  //疑似行业数据波动范围异常
  8.1: ['b9601a0f-22af-4a07-927f-82d6369f2e12'],
  // 疑似恒定值微小波动、疑似零值微小波动、
  8.2: ['cda1f2e2-ec5f-425b-93d2-94ba62b17146', '0fa091a3-7a19-4c9e-91bd-c5a4bf2e9827'],
  // 疑似设备或工控机断电
  8.3: ['178fd470-ca31-480a-835a-3322fd57a4f0'],
};

const ModalName = {
  与其他监测数据趋势一致: '疑似替换分析仪监测样气',
  与其他监测数据高度一致: '疑似借用其他监测设备数据',
  与本设备历史数据高度一致: '疑似借用本设备历史数据',
  多个污染物数据趋势一致: '疑似引用错误原始信号值',
  颗粒物浓度波动异常: '疑似修改颗粒物斜率截距',
  超过预设值波动变小: '疑似使用随机数产生数据',
  超过预设值有规律波动: '疑似按预设公式处理数据',
  超过预设值数据恒定: '疑似超过预设值数据恒定',
  气态污染物波动大幅减小: '疑似修改分析仪量程',
  超标时数据异常陡降: '疑似远程控制监测数据',
  疑似采样管线断开: '疑似监测样品为空气',
  气态污染物异常陡降: '疑似监测样品混入氮气',
  湿度异常陡降: '疑似监测样品混入氧混合气',
  疑似采样管线不密封: '疑似监测样品混入空气',
  烟气排放量数值异常: '疑似修改烟道截面积',
  折算浓度异常: '疑似修改标准标准过量空气系数',
  污染物排放量异常: '疑似修改速度场系数',
  计算公式或备案参数异常: '疑似计算公式或备案参数错误',
  机组停运未做停运标识: '疑似机组停运未及时上报',
  疑似数据标记异常: '疑似超过排放限值标记数据无效',
  停运标记不符合停运特征: '疑似机组停运错误标记',
  数据零值微小波动: '零值微小波动',
  数据恒定值微小波动: '恒定值微小波动',
  设备或工控机断电: '疑似设备或工控机断电',
  数据波动范围超行业特征: '疑似行业数据波动范围异常',
};

export const ModalNameConversion = name => {
  // if (ModalName[name]) {
  //   return ModalName[name];
  // }
  return name;
};

// 根据
export const GetModelInfoByGuid = {
  // 设备异常识别
  // 设备或工控机断电
  '178fd470-ca31-480a-835a-3322fd57a4f0': {
    method: '1.检查现场机柜、工控机、数采仪运行情况；2.检查数据转发软件是否正常转发。',
  },
  // 零值微小波动
  '0fa091a3-7a19-4c9e-91bd-c5a4bf2e9827': {
    method:
      '1.气态污染物通入N2进行仪表零点检查，渗透干燥过是否失效，SO2可以做损失率测试，清洗管线、冷腔；2.颗粒物进行零点检查和校准；3.必要时进行手工比对验证。',
  },
  // 恒定值微小波动
  'cda1f2e2-ec5f-425b-93d2-94ba62b17146': {
    method:
      '对仪表进行改变现有测量工况调整：1.气态污染物进行全量程标定；2.颗粒物粉尘仪探杆从烟道抽出，进行喷烟实验；3.湿度仪通入标气检查；4.压力、流速可以对仪表打压实验，检查流量计装置是否堵塞、腐蚀坏；5.温度可以抽出烟道测试；6.必要时进行手工比对验证。',
  },
  // 数据波动范围超行业特征
  'b9601a0f-22af-4a07-927f-82d6369f2e12': {
    method: '1.企业工况调整；2.检查设备是否故障；3.特殊工艺，超出现有行业范围，及时反馈。',
  },
  // --------------------------------------------
  // 样品气异常识别
  // 湿度异常陡降
  '1b9afa8d-1200-4fb1-aab0-a59936c3f22d': {
    method:
      '1.检查异常时间段是否有设备维护、校准等操作；2.检查湿度仪是否故障（检查参数，通N2测试；3.检查是否有用与正常运行范围浓度接近的氧标准气稀释样品气。',
  },
  // 疑似采样管线断开
  '9104ab9f-d3f3-4bd9-a0d9-898d87def4dd': {
    method:
      '正常生产工况O2浓度接近21%，气态污染物浓度接近于0：1.检查管路是否脱落；2.检查有无人为主观故意断开测量管路；3.检查是否进行了错误的零点校准（可通入空气查看测量值）',
  },
  // 疑似采样管线不密封
  '5520e6f2-ac4a-4f24-bafd-48746a13f4a4': {
    method:
      '正常生产工况O2浓度高于正常运行范围，污染物浓度低于正常运行范围：1.测试管路气密性；2.检查有无人为主观故意通入少量空气；',
  },
  // 气态污染物异常陡降
  '1fed575c-48d7-4eef-9266-735fe4bbdb2a': {
    method:
      '正常生产工况O2浓度低于正常运行范围，湿度明显下降，气态污染物异常降低：1）现场查看是否有通入少量N2人为稀释情况；2）检查异常时段有无维护校准操作',
  },
  // --------------------------------------------
  // 机组停运未做停运标识
  '928ec327-d30d-4803-ae83-eab3a93538c1': {
    method: '现场数据符合停运特征，实际停运状态，需及时在平台进行标记，环保部门报备；',
  },
  // 疑似数据标记异常
  '6675e28e-271a-4fb7-955b-79bf0b858e8e': {
    method:
      '1）检查异常时间段是否有设备维护、校准等操作；2）是否企业人为标记无效，掩盖污染物超标事实',
  },
  // 停运标记不符合停运特征
  '3568b3c6-d8db-42f1-bbff-e76406a67f7f': {
    method:
      '1）核实企业生产状况，停炉是否属实；2）查找O2、温度、流速不符停炉特征原因（如氧气<19%，温度（-20~35）℃以外，流速>2m/s；3）企业是否启炉，未及时撤销停运标记',
  },
  // -----------------
  // 烟气排放量数值异常
  'c934b575-a357-4a2c-b493-02849ce9cee3': {
    method:
      '1）查看烟气排放量计算公式是否正确；2）查看传输数据一致性；3)查看异常推送报警线索中的同一点位烟气静压,烟气湿度,流速,烟气温度基本相同情况下，烟气排放量为何出现大的偏差；4）查看烟道横截面积是否人为修改',
  },
  //  计算公式或备案参数异常
  'a59cce2a-8558-4c42-8a45-4d8402e4b29d': {
    method:
      '1）查看现场DAS软件及数采仪及平台数据一致性；2）查找公式计算的烟气排放量和实际上传烟气排放量中间的误差原因',
  },
  //  折算浓度异常
  '3d209ce2-da92-44c4-916b-8874d05da558': {
    method: '查看现场是否有修改标准过量空气系数或基准氧含量',
  },
  // -----------------
  // 测量值异常核实
  // 超过预设值波动变小
  '39680c93-e03f-42cf-a21f-115255251d4e': {
    method: '1)查看现场设备是否正常运行；2）仪表及工控机参数是否被修改；3）工控机是否有其他软件干扰监测，超过预设值按随机数处理。'
  },
  // 超过预设值有规律波动
  '983cd7b9-55e1-47f3-b369-2df7bc0a6111': {
    method:'1)查看现场设备是否正常运行；2）仪表及工控机参数是否被修改；3）工控机是否有其他软件干扰监测，超过预设值使用预设公式处理。'
  },
  // 超过预设值数据恒定
  '1a606047-6f21-4357-a459-03ef7788e09a': {
    method: '1)查看现场设备是否正常运行；2）仪表及工控机参数是否被修改；3）工控机是否有其他软件干扰监测，超过预设值使数据恒定输出。'
  },
  // 超标时数据异常陡降
  'b52087fb-563c-4939-a11f-f86b10da63c1': {
    method: '1)查看现场设备是否正常运行；2）仪表及工控机参数是否被修改；3）工控机是否有其他软件干扰监测，远程操控；'
  },
  // 与其他监测数据高度一致
  'ab2bf5ec-3ade-43fc-a720-c8fd92ede402': {
    method: '1）查看现场设备是否正常运行；2）是否借用同一现场其他设备数据'
  },
  // 与其他监测数据趋势一致
  'c0af25fb-220b-45c6-a3de-f6c8142de8f1': {
    method: '1）查看现场设备是否正常运行；2）是否在同一站房内，借用合格排放口烟气通入仪表（替换分析仪监测样气）'
  },
  // 与本设备历史数据高度一致
  'd5dea4cc-bd6c-44fa-a122-a1f44514b465': {
    method: '1）查看现场设备是否正常运行；2）是否借用本设备历史合格数据进行数据上传'
  },
  // 多个污染物数据趋势一致
  'f021147d-e7c6-4c1d-9634-1d814ff9880a': {
    method: '1）查看现场设备是否正常运行；2）是否借用本设备其他参数原始信号（如湿度信号借用到SO2信号,断开湿度信号，观察SO2是否变化）'
  },
  // 气态污染物波动大幅减小
  '069ab699-428a-4f4b-8df7-915d6b4f3215': {
    method: '1）查看现场设备是否正常运行；2）是否现场是否有人为更改分析仪量程；3）是否修改DAS软件量程或者PLC程序；'
  },
  // 颗粒物浓度波动异常
  '5bfd23c7-03da-4f4b-a258-a9c618774ab9': {
    method: '1）查看现场设备是否正常运行；2）有无工况变化；3）是否人为修改颗粒物截距、斜率系数、量程'
  }
};


// export const ChartDefaultSelected = {/*  */
//   // 疑似监测样品为空气
//   '9104ab9f-d3f3-4bd9-a0d9-898d87def4dd': [
//     {
//       PollutantCode: '03',
//       PollutantName: '实测NOx',
//     },
//   ],
//   // 疑似监测样品混入氮气
//   '1fed575c-48d7-4eef-9266-735fe4bbdb2a': [
//     {
//       PollutantCode: '03',
//       PollutantName: '实测NOx',
//     },
//   ],
//   // 疑似监测样品混入空气
//   '5520e6f2-ac4a-4f24-bafd-48746a13f4a4': [
//     {
//       PollutantCode: '03',
//       PollutantName: '实测NOx',
//     },
//   ],
//   // 疑似监测样品混入氧混合气
//   '1b9afa8d-1200-4fb1-aab0-a59936c3f22d': [
//     {
//       PollutantCode: '03',
//       PollutantName: '实测NOx',
//     },
//   ],
//   // 疑似人为修改过量空气系数
//   '3d209ce2-da92-44c4-916b-8874d05da558': [
//     {
//       PollutantCode: '02',
//       PollutantName: '实测SO₂',
//     },
//   ],
//   // 疑似人为修改速度场系数
//   'ce61d9a9-5d0d-4b66-abbd-72a89e823ee2': [
//     {
//       PollutantCode: '02',
//       PollutantName: '实测SO₂',
//     },
//   ],
//   // 疑似人为修改颗粒物斜率截距
//   '5bfd23c7-03da-4f4b-a258-a9c618774ab9': [
//     {
//       PollutantCode: '01',
//       PollutantName: '实测烟尘',
//     },
//   ],
//   // 疑似超过预设值数据恒定
//   '1a606047-6f21-4357-a459-03ef7788e09a': [
//     {
//       PollutantCode: '02',
//       PollutantName: '实测SO₂',
//     },
//     {
//       PollutantCode: '03',
//       PollutantName: '实测NOx',
//     },
//   ],
//   // 疑似使用随机数产生数据
//   '39680c93-e03f-42cf-a21f-115255251d4e': [
//     {
//       PollutantCode: '02',
//       PollutantName: '实测SO₂',
//     },
//     {
//       PollutantCode: '03',
//       PollutantName: '实测NOx',
//     },
//   ],
//   // 疑似按预设公式处理数据
//   '983cd7b9-55e1-47f3-b369-2df7bc0a6111': [
//     {
//       PollutantCode: '02',
//       PollutantName: '实测SO₂',
//     },
//     {
//       PollutantCode: '03',
//       PollutantName: '实测NOx',
//     },
//   ],
//   // 疑似篡改分析仪量程
//   '069ab699-428a-4f4b-8df7-915d6b4f3215': [
//     {
//       PollutantCode: '02',
//       PollutantName: '实测SO₂',
//     },
//     {
//       PollutantCode: '03',
//       PollutantName: '实测NOx',
//     },
//   ],
//   // 疑似机组停运未及时上报
//   '928ec327-d30d-4803-ae83-eab3a93538c1': [
//     {
//       PollutantCode: '03',
//       PollutantName: '实测NOx',
//     },
//   ],
//   // 疑似机组停运虚假标记
//   '3568b3c6-d8db-42f1-bbff-e76406a67f7f': [
//     {
//       PollutantCode: '03',
//       PollutantName: '实测NOx',
//     },
//   ],
// };
